
'number' + 3 + 3
// ВІДПОВІДЬ = 'number33'. 
// Тому що, якщо у виразі є рядок (стрінга), 
// то вона перетворює усі наступні значення в цьому виразі на рядки. Таким чином ми отримуємо:
//  перший рядок 'number' + 3 = 'number3' + 3 = 'number33'.


null + 3
// ВІДПОВІДЬ = 3.
//якшо null є у прикладі, то він перетворюється в значення 0. 
// Таким чином, ми отримуємо приклад 0 + 3 = 3.


5 && "qwerty"
// ВІДПОВІДЬ = qwerty.
// оператор && повертає перше помилкове значення, якщо воно є. 
// якщо немає, то повертає останне правдиве значення. 
// в даному прикладі, 5 = true, і стрінга qwerty теж = true. 
// Тому && повернув останнє правдиве значення qwerty


+'40' + +'2' + "hillel";
// ВІДПОВІДЬ = "42hillel"
// + перед стрінгою перетворює значення в число. Тобто +"40" = 40, і +"2" = 2.
// Таким чином, ми отримали вираз 40 + 2 + "hillel";
// далі число перетворюється в рядок (бо у виразі є число і рядок), і відбувається контактенація 42 + "hillel" 
// і дорівнює це все стрінзі "42hillel"


'10' - 5 === 6;
// ВІДПОВІДЬ = false
// так як у виразі є мінус (-), він перетворює усі операнди в числа
// а оператор === це строге порівняння
// таким чином ми отримуємо приклад 10 - 5 = 6, що є неправдою. Тобто false


true + false
// ВІДПОВІДЬ = 1
// тру і фолс це булеан (boolean). Коли вони містяться у математичних виразах, то перетворюються на 1 та 0 відповідно
// отже, 1 + 0 = 1


'4px' - 3
// ВІДПОВІДЬ = NaN
// так як у виразі ми маємо оператор мінус, то усі значення перетворюються на числа
// таким чином ми маємо 4px - 3. Але 4px це не чисте число.ю тому js повертає NaN (Not a Number)
// отже, NaN - 3 = NaN



'4' - 3
// ВІДПОВІДЬ = 1
// оператор мінус перетворює стрінгу "4" на число 4
// отже, отримуємо математичний вираз 4 - 3 = 1
// тут шось занадто просто)) 


'6' + 3 ** 0;
// ВІДПОВІДЬ = 61
// оператор ** означає взведення числа в степінь. Якщо ми взводимо будь-яке число в нульову степінь, відповідь завжди буде 1
// отже таким чином отримуємо вираз "6" + 1
// перетворюємо усе в стрінгу і конкатенуємо. Отримуємо відповідь 61


12 / '6'
// ВІДПОВІДЬ = 2
// оператор / один з тих, який перетворює рядки в числа.
// тому ми ділимо 12 на 6, що дорівнює 2


'10' + (5 === 6)
// ВІДПОВІДЬ = '10false' (string)
// першим ми розбираємось з виразом в дужках. 5 не строго дорівнює 6, тому тут значення false
// отримуємо вираз '10' + false
// так як 10 йде стрінгою, а не числом, js не буде приводити false до нуля. 
// А буде робити конкатенацію. І ми отримаємо рядок '10false'



null == ''
// ВІДПОВІДЬ = false
// == це оператор нестрогого порівняння. 
// null, якщо це нестроге порівнняня, може дорівнювати лише undifined. Тоді це було б true
// отже null не дорівнює порожньому рядку. І відповідь false


3 ** (9 / 3)
// ВІДПОВІДЬ = 27
// спочатку рахуємо вираз в дужках. Тут просто ділимо 9 на 3 = 3
// потім бачимо вираз 3 ** 3 (тобто, взводимо 3 в третю ступінь)
// і отримуємо відповідь 27 (тобто, три рази помножили 3 на 3)


!!'false' == !!'true'
// ВІДПОВІДЬ = true
// шо тут коїться. Оператор !! перетворює значення в правдивий булеан. 
// Тобто, ми маємо дві стрінги, які є true.
// отримали вираз з булеанів, true == true = true


0 || '0' && 1
// ВІДПОВІДЬ = 1
// маємо два оператори || та &&. Тут && пріорітетніший, тому спочатку виконуємо його.
// '0' && 1.  && повертає перше значення фолс, або останнє тру (якщо всі тру). "0" - це тру. 1 - це теж тру. Тому тут повертаємо 1
// вираз спрощується 0 || 1
// операторм || це "або". Повертає перше значення яке є true, або останнє значення false, якщо всі false.
// ітого.  0 || 1 . 0 - це фолс, а 1 - це тру. Отже, оператор || поверне значення true (1)


(+null == false) < 1;
// ВІДПОВІДЬ = false
// розв*язуємо приклад в дужках. +null перетворюємо в число (бо там стоїть +) і це буде 0
// 0 == false. Це true, тобто правда.  Нуль нестрого але дорівнює false. 
// у порівняння з оператором "<" false перетворюється в нуль (0). 
// отже, маємо вираз 0 < 1 що дорівнює неправді. Тобто false



false && true || true 
// ВІДПОВІДЬ = true
// оператор && пріорітетніший, тому першим виконуємо приклад false && true
// false && true  (&& повертає перше значення фолс, або останнє тру (якщо всі тру)). Тому тут відповідь false
// маємо вираз false || true. || це "або" і повертає він перше значення яке є true, або останнє значення false, якщо всі false.
// отже, так як ми маємо вираз false || true, то цей оператор поверне значення true (бо оно тут є)



false && (false || true); 
// ВІДПОВІДЬ = false
// спочатку виконуємо вираз в дужках (false || true). Тут буде відповідь true (бо оператор повертає перше значення true)
// далі маємо вираз false && true. Цей оператор першим повертає значення false. Тому така відповідь



(+null == false) < 1 ** 5;
// ВІДПОВІДЬ = false
// спочатку обчислюємо вираз в дужках. Null перетворюється в число бо перед ним стоїть +. 
// (0 == false) що дорівнює true. Бо нуль це фолс. 
// наступний наш вираз true < 1 ** 5   (чому тут 1 а не true? тому що оператор < перетворює true на 1)
// отже, 1 < 1 ** 5. Спочатку вдзводимо 1 в п*яту степінь = 1 (п*ять разів помножили 1 на 1)
// і фінальний вираз 1 < 1 (одиниця менше одиниці), що непавда. Тобто, false.